ФБКРозница/src/InformationRegisters/ПодтверждениеОплатыНДСВБюджет/ПодтверждениеОплатыНДСВБюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодтверждениеОплатыНДСВБюджет</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерОтметкиОРегистрации</name>
    <comment>Номер отметки о регистрации заявления в налоговом органе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПодтвержденияОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаПлатежноРасчетныеДокументы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидАгентскогоДоговора</name>
    <type>
      <types>EnumRef.ВидыАгентскихДоговоров</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </resources>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОплатыНДСВБюджет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокументаПеречисленияНалога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаПеречисленияНалога</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/InformationRegisters/ЗаданияКФормированиюЗаписейКнигиПокупокПродаж/ЗаданияКФормированиюЗаписейКнигиПокупокПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКФормированиюЗаписейКнигиПокупокПродаж</name>
  <comment>Технический регистр. Содержит в себе данные о документах учета входящего НДС, по которым необходимо сформировать записи книги покупок и продаж</comment>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/Enums/СостоянияОплатыНДСВБюджет/СостоянияОплатыНДСВБюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОплатыНДСВБюджет</name>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Оплачено</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПодтверждение</name>
  </enumValues>
</mdclass:Enum>

ФБКРозница/src/InformationRegisters/ПодтверждениеОплатыНДСВБюджет/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Состояние = Перечисления.СостоянияОплатыНДСВБюджет.Оплачено 
			И ЗначениеЗаполнено(Запись.ДатаДокументаПеречисленияНалога) Тогда
			
			Запись.СтрокаПлатежноРасчетныеДокументы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 от %2'"),
				Запись.НомерДокументаПеречисленияНалога,
				Формат(Запись.ДатаДокументаПеречисленияНалога, "ДЛФ=D"));
			
		КонецЕсли;
	КонецЦикла;
	
	Если ДополнительныеСвойства.Свойство("МенеджерВТ") Тогда
		ДополнительныеСвойства.Удалить("МенеджерВТ");
	КонецЕсли;
	
	Если Отбор.Состояние.Значение <> Перечисления.СостоянияОплатыНДСВБюджет.ОжидаетОплаты Тогда
	
		ДополнительныеСвойства.Вставить("МенеджерВТ", Новый МенеджерВременныхТаблиц);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВТ;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПодтверждениеОплатыНДСВБюджет.ДатаПодтвержденияОплаты, МЕСЯЦ) КАК ПериодПодтверждения,
		|	ПодтверждениеОплатыНДСВБюджет.СчетФактура.Организация КАК Организация
		|ПОМЕСТИТЬ ПериодыДоИзменения
		|ИЗ
		|	РегистрСведений.ПодтверждениеОплатыНДСВБюджет КАК ПодтверждениеОплатыНДСВБюджет
		|ГДЕ
		|	ПодтверждениеОплатыНДСВБюджет.СчетФактура = &СчетФактура
		|	И ПодтверждениеОплатыНДСВБюджет.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОплатыНДСВБюджет.ОжидаетОплаты)";
		Запрос.УстановитьПараметр("СчетФактура", Отбор.СчетФактура.Значение);
		Запрос.Выполнить();
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ДополнительныеСвойства.Свойство("МенеджерВТ") Тогда
		Возврат;
	КонецЕсли;
	
	// По всем периодам до и после записи формируем задания к формированию записей книг покупок/продаж.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВТ;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ПодтверждениеОплатыНДСВБюджет.ДатаПодтвержденияОплаты, МЕСЯЦ) КАК ПериодПодтверждения,
	|	ПодтверждениеОплатыНДСВБюджет.СчетФактура.Организация КАК Организация
	|ПОМЕСТИТЬ ПериодыПослеИзменения
	|ИЗ
	|	РегистрСведений.ПодтверждениеОплатыНДСВБюджет КАК ПодтверждениеОплатыНДСВБюджет
	|ГДЕ
	|	ПодтверждениеОплатыНДСВБюджет.СчетФактура = &СчетФактура
	|	И ПодтверждениеОплатыНДСВБюджет.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОплатыНДСВБюджет.ОжидаетОплаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыДоИзменения.ПериодПодтверждения КАК Период,
	|	ПериодыДоИзменения.Организация КАК Организация
	|ИЗ
	|	ПериодыДоИзменения КАК ПериодыДоИзменения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПериодыПослеИзменения.ПериодПодтверждения,
	|	ПериодыПослеИзменения.Организация
	|ИЗ
	|	ПериодыПослеИзменения КАК ПериодыПослеИзменения
	|";
	Запрос.УстановитьПараметр("СчетФактура", Отбор.СчетФактура.Значение);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Период) ИЛИ Выборка.Организация = Null Тогда
			// Выборка.Организация = Null будет в том случае, когда удаляется счет-фактура 
			// и в отборе уже стоит ссылка на несуществующий объект
			Продолжить;
		КонецЕсли;
		ПроверитьДатуЗапрета(Выборка.Период);
		РегистрыСведений.ЗаданияКФормированиюЗаписейКнигиПокупокПродаж.СоздатьЗаписьРегистра(Выборка.Период,
																							 Отбор.СчетФактура.Значение,
																							 Выборка.Организация);
	КонецЦикла;
																						 
КонецПроцедуры

Процедура ПроверитьДатуЗапрета(Период)
	
	ШаблонЗапретаДанных = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
	СтрокаШаблона = ШаблонЗапретаДанных.Добавить();
	СтрокаШаблона.Дата   = Период;
	СтрокаШаблона.Раздел = "РегламентныеОперации";
	
	Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ШаблонЗапретаДанных) Тогда
	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать данные оплаты НДС в периоде %1 из-за установленной даты запрета'"),
				Формат(Период,"ДФ='MMMM yyyy'"));
				
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ОплатаНДС'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
